docs/perf/raw/order-checkout-prepare-loadtest-guest-2026-03-31-rerun3.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scripts/loadtest/order-checkout-no-confirm.k6.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m30s max duration (incl. graceful stop):
              * checkout_prepare_load: 200.00 iterations/s for 3m0s (maxVUs: 100, gracefulStop: 30s)


running (0m01.0s), 100/100 VUs, 0 complete and 0 interrupted iterations
checkout_prepare_load   [   1% ] 100/100 VUs  0m01.0s/3m0s  200.00 iters/s

running (0m02.0s), 100/100 VUs, 5 complete and 0 interrupted iterations
checkout_prepare_load   [   1% ] 100/100 VUs  0m02.0s/3m0s  200.00 iters/s

running (0m03.0s), 100/100 VUs, 21 complete and 0 interrupted iterations
checkout_prepare_load   [   2% ] 100/100 VUs  0m03.0s/3m0s  200.00 iters/s

running (0m04.0s), 100/100 VUs, 35 complete and 0 interrupted iterations
checkout_prepare_load   [   2% ] 100/100 VUs  0m04.0s/3m0s  200.00 iters/s

running (0m05.0s), 100/100 VUs, 54 complete and 0 interrupted iterations
checkout_prepare_load   [   3% ] 100/100 VUs  0m05.0s/3m0s  200.00 iters/s

running (0m06.0s), 100/100 VUs, 69 complete and 0 interrupted iterations
checkout_prepare_load   [   3% ] 100/100 VUs  0m06.0s/3m0s  200.00 iters/s

running (0m07.0s), 100/100 VUs, 87 complete and 0 interrupted iterations
checkout_prepare_load   [   4% ] 100/100 VUs  0m07.0s/3m0s  200.00 iters/s

running (0m08.0s), 100/100 VUs, 103 complete and 0 interrupted iterations
checkout_prepare_load   [   4% ] 100/100 VUs  0m08.0s/3m0s  200.00 iters/s

running (0m09.0s), 100/100 VUs, 120 complete and 0 interrupted iterations
checkout_prepare_load   [   5% ] 100/100 VUs  0m09.0s/3m0s  200.00 iters/s

running (0m10.0s), 100/100 VUs, 133 complete and 0 interrupted iterations
checkout_prepare_load   [   6% ] 100/100 VUs  0m10.0s/3m0s  200.00 iters/s

running (0m11.0s), 100/100 VUs, 153 complete and 0 interrupted iterations
checkout_prepare_load   [   6% ] 100/100 VUs  0m11.0s/3m0s  200.00 iters/s

running (0m12.0s), 100/100 VUs, 175 complete and 0 interrupted iterations
checkout_prepare_load   [   7% ] 100/100 VUs  0m12.0s/3m0s  200.00 iters/s

running (0m13.0s), 100/100 VUs, 199 complete and 0 interrupted iterations
checkout_prepare_load   [   7% ] 100/100 VUs  0m13.0s/3m0s  200.00 iters/s

running (0m14.0s), 100/100 VUs, 217 complete and 0 interrupted iterations
checkout_prepare_load   [   8% ] 100/100 VUs  0m14.0s/3m0s  200.00 iters/s

running (0m15.0s), 100/100 VUs, 235 complete and 0 interrupted iterations
checkout_prepare_load   [   8% ] 100/100 VUs  0m15.0s/3m0s  200.00 iters/s

running (0m16.0s), 100/100 VUs, 254 complete and 0 interrupted iterations
checkout_prepare_load   [   9% ] 100/100 VUs  0m16.0s/3m0s  200.00 iters/s

running (0m17.0s), 100/100 VUs, 268 complete and 0 interrupted iterations
checkout_prepare_load   [   9% ] 100/100 VUs  0m17.0s/3m0s  200.00 iters/s

running (0m18.0s), 100/100 VUs, 289 complete and 0 interrupted iterations
checkout_prepare_load   [  10% ] 100/100 VUs  0m18.0s/3m0s  200.00 iters/s

running (0m19.0s), 100/100 VUs, 310 complete and 0 interrupted iterations
checkout_prepare_load   [  11% ] 100/100 VUs  0m19.0s/3m0s  200.00 iters/s

running (0m20.0s), 100/100 VUs, 329 complete and 0 interrupted iterations
checkout_prepare_load   [  11% ] 100/100 VUs  0m20.0s/3m0s  200.00 iters/s

running (0m21.0s), 100/100 VUs, 351 complete and 0 interrupted iterations
checkout_prepare_load   [  12% ] 100/100 VUs  0m21.0s/3m0s  200.00 iters/s

running (0m22.0s), 100/100 VUs, 374 complete and 0 interrupted iterations
checkout_prepare_load   [  12% ] 100/100 VUs  0m22.0s/3m0s  200.00 iters/s

running (0m23.0s), 100/100 VUs, 392 complete and 0 interrupted iterations
checkout_prepare_load   [  13% ] 100/100 VUs  0m23.0s/3m0s  200.00 iters/s

running (0m24.0s), 100/100 VUs, 412 complete and 0 interrupted iterations
checkout_prepare_load   [  13% ] 100/100 VUs  0m24.0s/3m0s  200.00 iters/s

running (0m25.0s), 100/100 VUs, 433 complete and 0 interrupted iterations
checkout_prepare_load   [  14% ] 100/100 VUs  0m25.0s/3m0s  200.00 iters/s

running (0m26.0s), 100/100 VUs, 455 complete and 0 interrupted iterations
checkout_prepare_load   [  14% ] 100/100 VUs  0m26.0s/3m0s  200.00 iters/s

running (0m27.0s), 100/100 VUs, 478 complete and 0 interrupted iterations
checkout_prepare_load   [  15% ] 100/100 VUs  0m27.0s/3m0s  200.00 iters/s

running (0m28.0s), 100/100 VUs, 509 complete and 0 interrupted iterations
checkout_prepare_load   [  16% ] 100/100 VUs  0m28.0s/3m0s  200.00 iters/s

running (0m29.0s), 100/100 VUs, 542 complete and 0 interrupted iterations
checkout_prepare_load   [  16% ] 100/100 VUs  0m29.0s/3m0s  200.00 iters/s

running (0m30.0s), 100/100 VUs, 563 complete and 0 interrupted iterations
checkout_prepare_load   [  17% ] 100/100 VUs  0m30.0s/3m0s  200.00 iters/s

running (0m31.0s), 100/100 VUs, 586 complete and 0 interrupted iterations
checkout_prepare_load   [  17% ] 100/100 VUs  0m31.0s/3m0s  200.00 iters/s

running (0m32.0s), 100/100 VUs, 610 complete and 0 interrupted iterations
checkout_prepare_load   [  18% ] 100/100 VUs  0m32.0s/3m0s  200.00 iters/s

running (0m33.0s), 100/100 VUs, 643 complete and 0 interrupted iterations
checkout_prepare_load   [  18% ] 100/100 VUs  0m33.0s/3m0s  200.00 iters/s

running (0m34.0s), 100/100 VUs, 676 complete and 0 interrupted iterations
checkout_prepare_load   [  19% ] 100/100 VUs  0m34.0s/3m0s  200.00 iters/s

running (0m35.0s), 100/100 VUs, 708 complete and 0 interrupted iterations
checkout_prepare_load   [  19% ] 100/100 VUs  0m35.0s/3m0s  200.00 iters/s

running (0m36.0s), 100/100 VUs, 743 complete and 0 interrupted iterations
checkout_prepare_load   [  20% ] 100/100 VUs  0m36.0s/3m0s  200.00 iters/s

running (0m37.0s), 099/100 VUs, 774 complete and 0 interrupted iterations
checkout_prepare_load   [  21% ] 099/100 VUs  0m37.0s/3m0s  200.00 iters/s

running (0m38.0s), 099/100 VUs, 800 complete and 0 interrupted iterations
checkout_prepare_load   [  21% ] 099/100 VUs  0m38.0s/3m0s  200.00 iters/s

running (0m39.0s), 100/100 VUs, 838 complete and 0 interrupted iterations
checkout_prepare_load   [  22% ] 100/100 VUs  0m39.0s/3m0s  200.00 iters/s

running (0m40.0s), 100/100 VUs, 864 complete and 0 interrupted iterations
checkout_prepare_load   [  22% ] 100/100 VUs  0m40.0s/3m0s  200.00 iters/s

running (0m41.0s), 100/100 VUs, 899 complete and 0 interrupted iterations
checkout_prepare_load   [  23% ] 100/100 VUs  0m41.0s/3m0s  200.00 iters/s

running (0m42.0s), 100/100 VUs, 931 complete and 0 interrupted iterations
checkout_prepare_load   [  23% ] 100/100 VUs  0m42.0s/3m0s  200.00 iters/s

running (0m43.0s), 100/100 VUs, 973 complete and 0 interrupted iterations
checkout_prepare_load   [  24% ] 100/100 VUs  0m43.0s/3m0s  200.00 iters/s

running (0m44.0s), 099/100 VUs, 1005 complete and 0 interrupted iterations
checkout_prepare_load   [  24% ] 099/100 VUs  0m44.0s/3m0s  200.00 iters/s

running (0m45.0s), 100/100 VUs, 1034 complete and 0 interrupted iterations
checkout_prepare_load   [  25% ] 100/100 VUs  0m45.0s/3m0s  200.00 iters/s

running (0m46.0s), 100/100 VUs, 1054 complete and 0 interrupted iterations
checkout_prepare_load   [  26% ] 100/100 VUs  0m46.0s/3m0s  200.00 iters/s

running (0m47.0s), 100/100 VUs, 1081 complete and 0 interrupted iterations
checkout_prepare_load   [  26% ] 100/100 VUs  0m47.0s/3m0s  200.00 iters/s

running (0m48.0s), 100/100 VUs, 1114 complete and 0 interrupted iterations
checkout_prepare_load   [  27% ] 100/100 VUs  0m48.0s/3m0s  200.00 iters/s

running (0m49.0s), 100/100 VUs, 1153 complete and 0 interrupted iterations
checkout_prepare_load   [  27% ] 100/100 VUs  0m49.0s/3m0s  200.00 iters/s

running (0m50.0s), 100/100 VUs, 1196 complete and 0 interrupted iterations
checkout_prepare_load   [  28% ] 100/100 VUs  0m50.0s/3m0s  200.00 iters/s

running (0m51.0s), 100/100 VUs, 1240 complete and 0 interrupted iterations
checkout_prepare_load   [  28% ] 100/100 VUs  0m51.0s/3m0s  200.00 iters/s

running (0m52.0s), 100/100 VUs, 1270 complete and 0 interrupted iterations
checkout_prepare_load   [  29% ] 100/100 VUs  0m52.0s/3m0s  200.00 iters/s

running (0m53.0s), 100/100 VUs, 1297 complete and 0 interrupted iterations
checkout_prepare_load   [  29% ] 100/100 VUs  0m53.0s/3m0s  200.00 iters/s

running (0m54.0s), 100/100 VUs, 1327 complete and 0 interrupted iterations
checkout_prepare_load   [  30% ] 100/100 VUs  0m54.0s/3m0s  200.00 iters/s

running (0m55.0s), 100/100 VUs, 1359 complete and 0 interrupted iterations
checkout_prepare_load   [  31% ] 100/100 VUs  0m55.0s/3m0s  200.00 iters/s

running (0m56.0s), 100/100 VUs, 1400 complete and 0 interrupted iterations
checkout_prepare_load   [  31% ] 100/100 VUs  0m56.0s/3m0s  200.00 iters/s

running (0m57.0s), 100/100 VUs, 1441 complete and 0 interrupted iterations
checkout_prepare_load   [  32% ] 100/100 VUs  0m57.0s/3m0s  200.00 iters/s

running (0m58.0s), 100/100 VUs, 1474 complete and 0 interrupted iterations
checkout_prepare_load   [  32% ] 100/100 VUs  0m58.0s/3m0s  200.00 iters/s

running (0m59.0s), 100/100 VUs, 1505 complete and 0 interrupted iterations
checkout_prepare_load   [  33% ] 100/100 VUs  0m59.0s/3m0s  200.00 iters/s

running (1m00.0s), 098/100 VUs, 1547 complete and 0 interrupted iterations
checkout_prepare_load   [  33% ] 098/100 VUs  1m00.0s/3m0s  200.00 iters/s

running (1m01.0s), 100/100 VUs, 1597 complete and 0 interrupted iterations
checkout_prepare_load   [  34% ] 100/100 VUs  1m01.0s/3m0s  200.00 iters/s

running (1m02.0s), 099/100 VUs, 1636 complete and 0 interrupted iterations
checkout_prepare_load   [  34% ] 099/100 VUs  1m02.0s/3m0s  200.00 iters/s

running (1m03.0s), 100/100 VUs, 1688 complete and 0 interrupted iterations
checkout_prepare_load   [  35% ] 100/100 VUs  1m03.0s/3m0s  200.00 iters/s

running (1m04.0s), 100/100 VUs, 1743 complete and 0 interrupted iterations
checkout_prepare_load   [  36% ] 100/100 VUs  1m04.0s/3m0s  200.00 iters/s

running (1m05.0s), 100/100 VUs, 1800 complete and 0 interrupted iterations
checkout_prepare_load   [  36% ] 100/100 VUs  1m05.0s/3m0s  200.00 iters/s

running (1m06.0s), 100/100 VUs, 1850 complete and 0 interrupted iterations
checkout_prepare_load   [  37% ] 100/100 VUs  1m06.0s/3m0s  200.00 iters/s

running (1m07.0s), 100/100 VUs, 1900 complete and 0 interrupted iterations
checkout_prepare_load   [  37% ] 100/100 VUs  1m07.0s/3m0s  200.00 iters/s

running (1m08.0s), 100/100 VUs, 1927 complete and 0 interrupted iterations
checkout_prepare_load   [  38% ] 100/100 VUs  1m08.0s/3m0s  200.00 iters/s

running (1m09.0s), 100/100 VUs, 1961 complete and 0 interrupted iterations
checkout_prepare_load   [  38% ] 100/100 VUs  1m09.0s/3m0s  200.00 iters/s

running (1m10.0s), 100/100 VUs, 2004 complete and 0 interrupted iterations
checkout_prepare_load   [  39% ] 100/100 VUs  1m10.0s/3m0s  200.00 iters/s

running (1m11.0s), 099/100 VUs, 2051 complete and 0 interrupted iterations
checkout_prepare_load   [  39% ] 099/100 VUs  1m11.0s/3m0s  200.00 iters/s

running (1m12.1s), 100/100 VUs, 2091 complete and 0 interrupted iterations
checkout_prepare_load   [  40% ] 100/100 VUs  1m12.1s/3m0s  200.00 iters/s

running (1m13.0s), 100/100 VUs, 2151 complete and 0 interrupted iterations
checkout_prepare_load   [  41% ] 100/100 VUs  1m13.0s/3m0s  200.00 iters/s

running (1m14.0s), 100/100 VUs, 2207 complete and 0 interrupted iterations
checkout_prepare_load   [  41% ] 100/100 VUs  1m14.0s/3m0s  200.00 iters/s

running (1m15.0s), 100/100 VUs, 2256 complete and 0 interrupted iterations
checkout_prepare_load   [  42% ] 100/100 VUs  1m15.0s/3m0s  200.00 iters/s

running (1m16.0s), 096/100 VUs, 2309 complete and 0 interrupted iterations
checkout_prepare_load   [  42% ] 096/100 VUs  1m16.0s/3m0s  200.00 iters/s

running (1m17.0s), 100/100 VUs, 2365 complete and 0 interrupted iterations
checkout_prepare_load   [  43% ] 100/100 VUs  1m17.0s/3m0s  200.00 iters/s

running (1m18.0s), 100/100 VUs, 2418 complete and 0 interrupted iterations
checkout_prepare_load   [  43% ] 100/100 VUs  1m18.0s/3m0s  200.00 iters/s

running (1m19.0s), 100/100 VUs, 2464 complete and 0 interrupted iterations
checkout_prepare_load   [  44% ] 100/100 VUs  1m19.0s/3m0s  200.00 iters/s

running (1m20.0s), 100/100 VUs, 2498 complete and 0 interrupted iterations
checkout_prepare_load   [  44% ] 100/100 VUs  1m20.0s/3m0s  200.00 iters/s

running (1m21.0s), 100/100 VUs, 2552 complete and 0 interrupted iterations
checkout_prepare_load   [  45% ] 100/100 VUs  1m21.0s/3m0s  200.00 iters/s

running (1m22.0s), 100/100 VUs, 2594 complete and 0 interrupted iterations
checkout_prepare_load   [  46% ] 100/100 VUs  1m22.0s/3m0s  200.00 iters/s

running (1m23.0s), 100/100 VUs, 2647 complete and 0 interrupted iterations
checkout_prepare_load   [  46% ] 100/100 VUs  1m23.0s/3m0s  200.00 iters/s

running (1m24.0s), 100/100 VUs, 2705 complete and 0 interrupted iterations
checkout_prepare_load   [  47% ] 100/100 VUs  1m24.0s/3m0s  200.00 iters/s

running (1m25.0s), 100/100 VUs, 2758 complete and 0 interrupted iterations
checkout_prepare_load   [  47% ] 100/100 VUs  1m25.0s/3m0s  200.00 iters/s

running (1m26.0s), 100/100 VUs, 2804 complete and 0 interrupted iterations
checkout_prepare_load   [  48% ] 100/100 VUs  1m26.0s/3m0s  200.00 iters/s

running (1m27.0s), 100/100 VUs, 2854 complete and 0 interrupted iterations
checkout_prepare_load   [  48% ] 100/100 VUs  1m27.0s/3m0s  200.00 iters/s

running (1m28.0s), 100/100 VUs, 2894 complete and 0 interrupted iterations
checkout_prepare_load   [  49% ] 100/100 VUs  1m28.0s/3m0s  200.00 iters/s

running (1m29.0s), 096/100 VUs, 2944 complete and 0 interrupted iterations
checkout_prepare_load   [  49% ] 096/100 VUs  1m29.0s/3m0s  200.00 iters/s

running (1m30.0s), 100/100 VUs, 2988 complete and 0 interrupted iterations
checkout_prepare_load   [  50% ] 100/100 VUs  1m30.0s/3m0s  200.00 iters/s

running (1m31.0s), 100/100 VUs, 3045 complete and 0 interrupted iterations
checkout_prepare_load   [  51% ] 100/100 VUs  1m31.0s/3m0s  200.00 iters/s

running (1m32.0s), 099/100 VUs, 3092 complete and 0 interrupted iterations
checkout_prepare_load   [  51% ] 099/100 VUs  1m32.0s/3m0s  200.00 iters/s

running (1m33.0s), 098/100 VUs, 3152 complete and 0 interrupted iterations
checkout_prepare_load   [  52% ] 098/100 VUs  1m33.0s/3m0s  200.00 iters/s

running (1m34.0s), 099/100 VUs, 3211 complete and 0 interrupted iterations
checkout_prepare_load   [  52% ] 099/100 VUs  1m34.0s/3m0s  200.00 iters/s

running (1m35.0s), 100/100 VUs, 3266 complete and 0 interrupted iterations
checkout_prepare_load   [  53% ] 100/100 VUs  1m35.0s/3m0s  200.00 iters/s

running (1m36.0s), 099/100 VUs, 3322 complete and 0 interrupted iterations
checkout_prepare_load   [  53% ] 099/100 VUs  1m36.0s/3m0s  200.00 iters/s

running (1m37.0s), 098/100 VUs, 3384 complete and 0 interrupted iterations
checkout_prepare_load   [  54% ] 098/100 VUs  1m37.0s/3m0s  200.00 iters/s

running (1m38.0s), 099/100 VUs, 3433 complete and 0 interrupted iterations
checkout_prepare_load   [  54% ] 099/100 VUs  1m38.0s/3m0s  200.00 iters/s

running (1m39.0s), 099/100 VUs, 3488 complete and 0 interrupted iterations
checkout_prepare_load   [  55% ] 099/100 VUs  1m39.0s/3m0s  200.00 iters/s

running (1m40.0s), 100/100 VUs, 3529 complete and 0 interrupted iterations
checkout_prepare_load   [  56% ] 100/100 VUs  1m40.0s/3m0s  200.00 iters/s

running (1m41.0s), 100/100 VUs, 3595 complete and 0 interrupted iterations
checkout_prepare_load   [  56% ] 100/100 VUs  1m41.0s/3m0s  200.00 iters/s

running (1m42.0s), 100/100 VUs, 3644 complete and 0 interrupted iterations
checkout_prepare_load   [  57% ] 100/100 VUs  1m42.0s/3m0s  200.00 iters/s

running (1m43.0s), 100/100 VUs, 3710 complete and 0 interrupted iterations
checkout_prepare_load   [  57% ] 100/100 VUs  1m43.0s/3m0s  200.00 iters/s

running (1m44.0s), 100/100 VUs, 3772 complete and 0 interrupted iterations
checkout_prepare_load   [  58% ] 100/100 VUs  1m44.0s/3m0s  200.00 iters/s

running (1m45.0s), 099/100 VUs, 3834 complete and 0 interrupted iterations
checkout_prepare_load   [  58% ] 099/100 VUs  1m45.0s/3m0s  200.00 iters/s

running (1m46.0s), 100/100 VUs, 3889 complete and 0 interrupted iterations
checkout_prepare_load   [  59% ] 100/100 VUs  1m46.0s/3m0s  200.00 iters/s

running (1m47.0s), 100/100 VUs, 3952 complete and 0 interrupted iterations
checkout_prepare_load   [  59% ] 100/100 VUs  1m47.0s/3m0s  200.00 iters/s

running (1m48.0s), 100/100 VUs, 4008 complete and 0 interrupted iterations
checkout_prepare_load   [  60% ] 100/100 VUs  1m48.0s/3m0s  200.00 iters/s

running (1m49.0s), 100/100 VUs, 4063 complete and 0 interrupted iterations
checkout_prepare_load   [  61% ] 100/100 VUs  1m49.0s/3m0s  200.00 iters/s

running (1m50.0s), 100/100 VUs, 4124 complete and 0 interrupted iterations
checkout_prepare_load   [  61% ] 100/100 VUs  1m50.0s/3m0s  200.00 iters/s

running (1m51.0s), 099/100 VUs, 4184 complete and 0 interrupted iterations
checkout_prepare_load   [  62% ] 099/100 VUs  1m51.0s/3m0s  200.00 iters/s

running (1m52.0s), 099/100 VUs, 4242 complete and 0 interrupted iterations
checkout_prepare_load   [  62% ] 099/100 VUs  1m52.0s/3m0s  200.00 iters/s

running (1m53.0s), 100/100 VUs, 4301 complete and 0 interrupted iterations
checkout_prepare_load   [  63% ] 100/100 VUs  1m53.0s/3m0s  200.00 iters/s

running (1m54.0s), 100/100 VUs, 4364 complete and 0 interrupted iterations
checkout_prepare_load   [  63% ] 100/100 VUs  1m54.0s/3m0s  200.00 iters/s

running (1m55.0s), 100/100 VUs, 4422 complete and 0 interrupted iterations
checkout_prepare_load   [  64% ] 100/100 VUs  1m55.0s/3m0s  200.00 iters/s

running (1m56.0s), 100/100 VUs, 4488 complete and 0 interrupted iterations
checkout_prepare_load   [  64% ] 100/100 VUs  1m56.0s/3m0s  200.00 iters/s

running (1m57.0s), 098/100 VUs, 4552 complete and 0 interrupted iterations
checkout_prepare_load   [  65% ] 098/100 VUs  1m57.0s/3m0s  200.00 iters/s

running (1m58.0s), 100/100 VUs, 4608 complete and 0 interrupted iterations
checkout_prepare_load   [  66% ] 100/100 VUs  1m58.0s/3m0s  200.00 iters/s

running (1m59.0s), 099/100 VUs, 4662 complete and 0 interrupted iterations
checkout_prepare_load   [  66% ] 099/100 VUs  1m59.0s/3m0s  200.00 iters/s

running (2m00.0s), 100/100 VUs, 4724 complete and 0 interrupted iterations
checkout_prepare_load   [  67% ] 100/100 VUs  2m00.0s/3m0s  200.00 iters/s

running (2m01.0s), 100/100 VUs, 4784 complete and 0 interrupted iterations
checkout_prepare_load   [  67% ] 100/100 VUs  2m01.0s/3m0s  200.00 iters/s

running (2m02.0s), 100/100 VUs, 4842 complete and 0 interrupted iterations
checkout_prepare_load   [  68% ] 100/100 VUs  2m02.0s/3m0s  200.00 iters/s

running (2m03.0s), 100/100 VUs, 4907 complete and 0 interrupted iterations
checkout_prepare_load   [  68% ] 100/100 VUs  2m03.0s/3m0s  200.00 iters/s

running (2m04.1s), 096/100 VUs, 4964 complete and 0 interrupted iterations
checkout_prepare_load   [  69% ] 097/100 VUs  2m04.1s/3m0s  200.00 iters/s

running (2m05.0s), 100/100 VUs, 5033 complete and 0 interrupted iterations
checkout_prepare_load   [  69% ] 100/100 VUs  2m05.0s/3m0s  200.00 iters/s

running (2m06.0s), 099/100 VUs, 5099 complete and 0 interrupted iterations
checkout_prepare_load   [  70% ] 099/100 VUs  2m06.0s/3m0s  200.00 iters/s

running (2m07.0s), 100/100 VUs, 5146 complete and 0 interrupted iterations
checkout_prepare_load   [  71% ] 100/100 VUs  2m07.0s/3m0s  200.00 iters/s

running (2m08.0s), 099/100 VUs, 5174 complete and 0 interrupted iterations
checkout_prepare_load   [  71% ] 099/100 VUs  2m08.0s/3m0s  200.00 iters/s

running (2m09.0s), 099/100 VUs, 5235 complete and 0 interrupted iterations
checkout_prepare_load   [  72% ] 099/100 VUs  2m09.0s/3m0s  200.00 iters/s

running (2m10.0s), 100/100 VUs, 5292 complete and 0 interrupted iterations
checkout_prepare_load   [  72% ] 100/100 VUs  2m10.0s/3m0s  200.00 iters/s

running (2m11.0s), 100/100 VUs, 5363 complete and 0 interrupted iterations
checkout_prepare_load   [  73% ] 100/100 VUs  2m11.0s/3m0s  200.00 iters/s

running (2m12.0s), 100/100 VUs, 5419 complete and 0 interrupted iterations
checkout_prepare_load   [  73% ] 100/100 VUs  2m12.0s/3m0s  200.00 iters/s

running (2m13.0s), 100/100 VUs, 5485 complete and 0 interrupted iterations
checkout_prepare_load   [  74% ] 100/100 VUs  2m13.0s/3m0s  200.00 iters/s

running (2m14.0s), 100/100 VUs, 5556 complete and 0 interrupted iterations
checkout_prepare_load   [  74% ] 100/100 VUs  2m14.0s/3m0s  200.00 iters/s

running (2m15.0s), 100/100 VUs, 5626 complete and 0 interrupted iterations
checkout_prepare_load   [  75% ] 100/100 VUs  2m15.0s/3m0s  200.00 iters/s

running (2m16.0s), 100/100 VUs, 5687 complete and 0 interrupted iterations
checkout_prepare_load   [  76% ] 100/100 VUs  2m16.0s/3m0s  200.00 iters/s

running (2m17.0s), 100/100 VUs, 5752 complete and 0 interrupted iterations
checkout_prepare_load   [  76% ] 100/100 VUs  2m17.0s/3m0s  200.00 iters/s

running (2m18.0s), 099/100 VUs, 5821 complete and 0 interrupted iterations
checkout_prepare_load   [  77% ] 099/100 VUs  2m18.0s/3m0s  200.00 iters/s

running (2m19.0s), 100/100 VUs, 5884 complete and 0 interrupted iterations
checkout_prepare_load   [  77% ] 100/100 VUs  2m19.0s/3m0s  200.00 iters/s

running (2m20.0s), 099/100 VUs, 5954 complete and 0 interrupted iterations
checkout_prepare_load   [  78% ] 099/100 VUs  2m20.0s/3m0s  200.00 iters/s

running (2m21.0s), 100/100 VUs, 6008 complete and 0 interrupted iterations
checkout_prepare_load   [  78% ] 100/100 VUs  2m21.0s/3m0s  200.00 iters/s

running (2m22.1s), 097/100 VUs, 6050 complete and 0 interrupted iterations
checkout_prepare_load   [  79% ] 097/100 VUs  2m22.1s/3m0s  200.00 iters/s

running (2m23.0s), 100/100 VUs, 6123 complete and 0 interrupted iterations
checkout_prepare_load   [  79% ] 100/100 VUs  2m23.0s/3m0s  200.00 iters/s

running (2m24.0s), 100/100 VUs, 6197 complete and 0 interrupted iterations
checkout_prepare_load   [  80% ] 100/100 VUs  2m24.0s/3m0s  200.00 iters/s

running (2m25.0s), 100/100 VUs, 6261 complete and 0 interrupted iterations
checkout_prepare_load   [  81% ] 100/100 VUs  2m25.0s/3m0s  200.00 iters/s

running (2m26.0s), 100/100 VUs, 6325 complete and 0 interrupted iterations
checkout_prepare_load   [  81% ] 100/100 VUs  2m26.0s/3m0s  200.00 iters/s

running (2m27.0s), 100/100 VUs, 6395 complete and 0 interrupted iterations
checkout_prepare_load   [  82% ] 100/100 VUs  2m27.0s/3m0s  200.00 iters/s

running (2m28.0s), 094/100 VUs, 6469 complete and 0 interrupted iterations
checkout_prepare_load   [  82% ] 094/100 VUs  2m28.0s/3m0s  200.00 iters/s

running (2m29.0s), 100/100 VUs, 6527 complete and 0 interrupted iterations
checkout_prepare_load   [  83% ] 100/100 VUs  2m29.0s/3m0s  200.00 iters/s

running (2m30.0s), 100/100 VUs, 6601 complete and 0 interrupted iterations
checkout_prepare_load   [  83% ] 100/100 VUs  2m30.0s/3m0s  200.00 iters/s

running (2m31.0s), 100/100 VUs, 6671 complete and 0 interrupted iterations
checkout_prepare_load   [  84% ] 100/100 VUs  2m31.0s/3m0s  200.00 iters/s

running (2m32.0s), 100/100 VUs, 6737 complete and 0 interrupted iterations
checkout_prepare_load   [  84% ] 100/100 VUs  2m32.0s/3m0s  200.00 iters/s

running (2m33.0s), 100/100 VUs, 6811 complete and 0 interrupted iterations
checkout_prepare_load   [  85% ] 100/100 VUs  2m33.0s/3m0s  200.00 iters/s

running (2m34.0s), 099/100 VUs, 6877 complete and 0 interrupted iterations
checkout_prepare_load   [  86% ] 099/100 VUs  2m34.0s/3m0s  200.00 iters/s

running (2m35.0s), 099/100 VUs, 6950 complete and 0 interrupted iterations
checkout_prepare_load   [  86% ] 099/100 VUs  2m35.0s/3m0s  200.00 iters/s

running (2m36.0s), 100/100 VUs, 7020 complete and 0 interrupted iterations
checkout_prepare_load   [  87% ] 100/100 VUs  2m36.0s/3m0s  200.00 iters/s

running (2m37.0s), 100/100 VUs, 7096 complete and 0 interrupted iterations
checkout_prepare_load   [  87% ] 100/100 VUs  2m37.0s/3m0s  200.00 iters/s

running (2m38.0s), 099/100 VUs, 7155 complete and 0 interrupted iterations
checkout_prepare_load   [  88% ] 099/100 VUs  2m38.0s/3m0s  200.00 iters/s

running (2m39.0s), 094/100 VUs, 7228 complete and 0 interrupted iterations
checkout_prepare_load   [  88% ] 094/100 VUs  2m39.0s/3m0s  200.00 iters/s

running (2m40.0s), 100/100 VUs, 7295 complete and 0 interrupted iterations
checkout_prepare_load   [  89% ] 100/100 VUs  2m40.0s/3m0s  200.00 iters/s

running (2m41.0s), 100/100 VUs, 7377 complete and 0 interrupted iterations
checkout_prepare_load   [  89% ] 100/100 VUs  2m41.0s/3m0s  200.00 iters/s

running (2m42.0s), 100/100 VUs, 7433 complete and 0 interrupted iterations
checkout_prepare_load   [  90% ] 100/100 VUs  2m42.0s/3m0s  200.00 iters/s

running (2m43.0s), 100/100 VUs, 7504 complete and 0 interrupted iterations
checkout_prepare_load   [  91% ] 100/100 VUs  2m43.0s/3m0s  200.00 iters/s

running (2m44.0s), 098/100 VUs, 7583 complete and 0 interrupted iterations
checkout_prepare_load   [  91% ] 098/100 VUs  2m44.0s/3m0s  200.00 iters/s

running (2m45.0s), 100/100 VUs, 7663 complete and 0 interrupted iterations
checkout_prepare_load   [  92% ] 100/100 VUs  2m45.0s/3m0s  200.00 iters/s

running (2m46.0s), 098/100 VUs, 7737 complete and 0 interrupted iterations
checkout_prepare_load   [  92% ] 098/100 VUs  2m46.0s/3m0s  200.00 iters/s

running (2m47.0s), 100/100 VUs, 7815 complete and 0 interrupted iterations
checkout_prepare_load   [  93% ] 100/100 VUs  2m47.0s/3m0s  200.00 iters/s

running (2m48.0s), 100/100 VUs, 7888 complete and 0 interrupted iterations
checkout_prepare_load   [  93% ] 100/100 VUs  2m48.0s/3m0s  200.00 iters/s

running (2m49.0s), 100/100 VUs, 7958 complete and 0 interrupted iterations
checkout_prepare_load   [  94% ] 100/100 VUs  2m49.0s/3m0s  200.00 iters/s

running (2m50.0s), 100/100 VUs, 8021 complete and 0 interrupted iterations
checkout_prepare_load   [  94% ] 100/100 VUs  2m50.0s/3m0s  200.00 iters/s

running (2m51.0s), 100/100 VUs, 8093 complete and 0 interrupted iterations
checkout_prepare_load   [  95% ] 100/100 VUs  2m51.0s/3m0s  200.00 iters/s

running (2m52.0s), 099/100 VUs, 8165 complete and 0 interrupted iterations
checkout_prepare_load   [  96% ] 099/100 VUs  2m52.0s/3m0s  200.00 iters/s

running (2m53.0s), 100/100 VUs, 8235 complete and 0 interrupted iterations
checkout_prepare_load   [  96% ] 100/100 VUs  2m53.0s/3m0s  200.00 iters/s

running (2m54.0s), 100/100 VUs, 8304 complete and 0 interrupted iterations
checkout_prepare_load   [  97% ] 100/100 VUs  2m54.0s/3m0s  200.00 iters/s

running (2m55.0s), 100/100 VUs, 8382 complete and 0 interrupted iterations
checkout_prepare_load   [  97% ] 100/100 VUs  2m55.0s/3m0s  200.00 iters/s

running (2m56.0s), 100/100 VUs, 8458 complete and 0 interrupted iterations
checkout_prepare_load   [  98% ] 100/100 VUs  2m56.0s/3m0s  200.00 iters/s

running (2m57.0s), 100/100 VUs, 8537 complete and 0 interrupted iterations
checkout_prepare_load   [  98% ] 100/100 VUs  2m57.0s/3m0s  200.00 iters/s

running (2m58.0s), 098/100 VUs, 8616 complete and 0 interrupted iterations
checkout_prepare_load   [  99% ] 098/100 VUs  2m58.0s/3m0s  200.00 iters/s

running (2m59.0s), 100/100 VUs, 8682 complete and 0 interrupted iterations
checkout_prepare_load   [  99% ] 100/100 VUs  2m59.0s/3m0s  200.00 iters/s

running (3m00.0s), 094/100 VUs, 8755 complete and 0 interrupted iterations
checkout_prepare_load   [ 100% ] 094/100 VUs  3m00.0s/3m0s  200.00 iters/s

running (3m01.0s), 032/100 VUs, 8820 complete and 0 interrupted iterations
checkout_prepare_load ↓ [ 100% ] 097/100 VUs  3m0s  200.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<5000' p(95)=4.5s

    http_req_failed
    ✓ 'rate<0.99' rate=0.00%

    order_create_error_rate
    ✓ 'rate<0.99' rate=0.00%

    order_create_latency_ms
    ✓ 'p(99)<8000' p(99)=5.86s


  █ TOTAL RESULTS 

    CUSTOM
    order_create_error_rate........: 0.00%  0 out of 8852
    order_create_latency_ms........: avg=2.02s min=1.01s med=1.68s max=6.93s p(90)=3.21s p(95)=4.5s p(99)=5.86s
    order_create_success_total.....: 8852   48.807085/s

    HTTP
    http_req_duration..............: avg=2.02s min=1.01s med=1.68s max=6.93s p(90)=3.21s p(95)=4.5s p(99)=5.86s
      { expected_response:true }...: avg=2.02s min=1.01s med=1.68s max=6.93s p(90)=3.21s p(95)=4.5s p(99)=5.86s
    http_req_failed................: 0.00%  0 out of 8852
    http_reqs......................: 8852   48.807085/s

    EXECUTION
    dropped_iterations.............: 27149  149.690866/s
    iteration_duration.............: avg=2.02s min=1.01s med=1.68s max=6.99s p(90)=3.21s p(95)=4.5s p(99)=5.86s
    iterations.....................: 8852   48.807085/s
    vus............................: 32     min=32        max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 6.9 MB 38 kB/s
    data_sent......................: 4.3 MB 24 kB/s



running (3m01.4s), 000/100 VUs, 8852 complete and 0 interrupted iterations
checkout_prepare_load ✓ [ 100% ] 000/100 VUs  3m0s  200.00 iters/s